# Выведите все элементы списка с четными индексами (то есть A[0], A[2], A[4]
names = ['Хонока', 'Котори', 'Уми', 'Маки',
         'Ханаё', 'Рин', 'Нико', 'Нозоми', 'Эли']
print(" ".join(names[::2]))
